In [1]:
%load_ext sql
import sqlite3

In [2]:
%sql sqlite:///CourseDataWarehouse.db

'Connected: @CourseDataWarehouse.db'

# 7. Datawarehouse Integrity Tests

## A. How many courses are offered in 2018?

In [38]:
%%sql 
SELECT TERM, count(DISTINCT CATALOG_ID)
FROM COURSE_FACTS
    JOIN CALENDAR_DATES USING (TERM)
WHERE TERM LIKE '%2018%'
GROUP BY TERM

 * sqlite:///CourseDataWarehouse.db
Done.

[('Fall2018', 612),
 ('Spring2018', 642),
 ('Summer2018', 151),
 ('Winter2018', 9)]

## B. How many courses are offered in Bannow?

In [4]:
%%sql
SELECT ROOM_ID, count(DISTINCT CATALOG_ID)
FROM COURSE_FACTS
    JOIN LOCATIONS USING (LOCATION_ID)
WHERE ROOM_ID LIKE '%BNW%'

 * sqlite:///CourseDataWarehouse.db
Done.

[('BNW 341', 612)]

## C. How many courses does a professor teach in Spring 2018 in the Art History Department?

In [21]:
%%sql
SELECT INSTRUCTOR_ID, INSTRUCTOR_NAME, PROGRAM_NAME, TERM, count (DISTINCT CATALOG_ID)
FROM COURSE_FACTS
    JOIN INSTRUCTORS USING (INSTRUCTOR_ID)
    JOIN PROGRAMS USING (PROGRAM_ID)
WHERE TERM = 'Spring2018' and PROGRAM_NAME = 'Art History'
GROUP BY INSTRUCTOR_ID
LIMIT 10;

 * sqlite:///CourseDataWarehouse.db
Done.

[(36, 'Katherine A.  Schwab', 'Art History', 'Spring2018', 2),
 (37, 'Philip I.  Eliasoph', 'Art History', 'Spring2018', 3),
 (38, 'Marice E.  Rose', 'Art History', 'Spring2018', 1),
 (41, 'Ive E.  Covaci', 'Art History', 'Spring2018', 1),
 (689, 'Megan K.  Paqua', 'Art History', 'Spring2018', 1),
 (781, 'Michelle Marie  DiMarzo', 'Art History', 'Spring2018', 1),
 (1007, 'Andrew M.  Davenport', 'Art History', 'Spring2018', 1)]

## D. What courses are in the Biology program?

In [15]:
%%sql
SELECT DISTINCT PROGRAM_ID, PROGRAM_NAME, CATALOG_ID, TITLE
FROM COURSE_FACTS
    JOIN PROGRAMS USING (PROGRAM_ID)
WHERE PROGRAM_NAME = 'Biology'
LIMIT 10;

 * sqlite:///CourseDataWarehouse.db
Done.

[(10, 'Biology', 'BI 0015', 'Fundamentals of Biology I'),
 (10, 'Biology', 'BI 0016', 'Fundamentals of Biology II'),
 (10, 'Biology', 'BI 0018', 'Human Biology: Form and Function'),
 (10, 'Biology', 'BI 0070', 'Science, Technology, and Society'),
 (10, 'Biology', 'BI 0071', 'Identity and the Human Genome'),
 (10, 'Biology', 'BI 0073', 'Contemporary Nutrition: Food for Thought'),
 (10, 'Biology', 'BI 0074', 'Biology of Food'),
 (10, 'Biology', 'BI 0075', 'Ecology and Society'),
 (10, 'Biology', 'BI 0076', 'Environmental Science'),
 (10, 'Biology', 'BI 0078', 'Introduction to Marine Science')]

## E. On Thursday's how many classes are offered at lunch-time in the Spring 2019 semester?

In [35]:
%%sql
SELECT DAY, START, TERM, count(CATALOG_ID)
FROM COURSE_FACTS
    JOIN TIME_SLICES USING (TIMECODE)
WHERE DAY = 'R' and START = '12:30:00' and TERM = 'Spring2019'

 * sqlite:///CourseDataWarehouse.db
Done.

[('R', '12:30:00', 'Spring2019', 66)]